# -*- coding: utf-8 -*-

import subprocess
from voiceroid2 import VoiceRoid2

import flask

# voiceroid2の起動
voiceroid2_path = "C:\Program Files (x86)\AHS\VOICEROID2\VoiceroidEditor.exe"
subprocess.Popen(voiceroid2_path)


self._search_child_byclassname(self.texteditview_name_list, self.voiceroid2_ele)


import json

aaaa = '[{"id": "1098874316374953984","screen_name":"fr6HUTTd3CDpH09","name":"みそ","message":"インフラエンジニアに転職したい！ CCNAに挑戦中。勉強の記録のためにぶつぶつ呟いてます。","xxx":true,"following":105,"followers":149}]'
type(json.loads('[{"aa":1,"bb":2},{"aa":1,"bb":2},{"aa":1,"bb":2}]'))


json.loads(aaaa)


vr2 = VoiceRoid2()


vr2.voiceroid2_ele.children()

tmp_ele = vr2.voiceroid2_ele.children()[3]
tmp_ele
tmp_ele.name
tmp_ele.class_name

"https://sefiks.com/2018/05/13/a-step-by-step-c4-5-decision-tree-example/"



text = """



政界進出[編集]

ヒトラーのドイツ労働者党党員証。しかし、彼の入党時に正式な党員証はまだなく、後に偽造されたものである。
政治家への転身を考えた後も軍に在籍を続ける道を選び、陸軍病院から退院すると部隊の根拠地であるミュンヘンへと戻った。同地では1918年11月8日にクルト・アイスナーによって共和制宣言が出されて「バイエルン共和国」が成立しており、バイエルンの陸軍も当初これを支援していた[110]。ヒトラーも1919年2月16日からミュンヘンのレーテに入っていた[110]。また2月26日に暗殺されたアイスナーの国葬パレードに参加した[111][112]。1919年4月13日にはオイゲン・レヴィーネによって共産党主導のバイエルン・レーテ共和国が成立した。4月15日にヒトラーはレーテの評議員に立候補しており、19票を獲得して当選している[113][114][115][110]。
5月、ヴァイマル共和国軍によってミュンヘンが占領されると、ヒトラーは革命中に政治活動をしていた人物に、共産主義傾向があるかを調べる革命調査委員会の委員となった[114][110]。この委員会での働きが認められ、ヒトラーは帰還兵への政治教育を行う啓発教育部隊に入ることとなった[110]。6月には国軍の情報将校であったカール・マイヤー大尉によってミュンヘン大学で予備教育を受けるよう命ぜられた。ヒトラーはこの時に初めて大学でゴットフリート・フェーダーなどの知識人の専門的な講義を聴く機会を持ち、潜入捜査の技能と「戦争で士気が阻喪し、ボリシェヴィキ化した部隊に民族主義を植え付けさせる」のに必要な教養を与えられた[116]。この際ヒトラーは同じく講習を受けていた兵士たちに反ユダヤ主義を交えた演説を行い、兵士たちを感激させた[117]。ヒトラー自身もはじめての演説に好感触を得、「私は演説することができた」と回想している[117]。
7月、ヒトラーは正式に国軍の情報提供者（Verbindungsmann）の名簿に軍属情報員（Aufklärungskommando）として登録され、諜報組織の末端となった。9月12日、ヒトラーはマイヤー大尉の命令でドイツ労働者党（DAP）の調査に入った。ヒトラーはこのとき、オーストリアとバイエルンの連合を唱える大学教授のバウマンと論戦になった。ドイツ労働者党の創設者アントン・ドレクスラーは「短いがキビキビとした演説を行い、皆を熱狂させた」と回想している[117]。ドレクスラーはヒトラーの演説の際に感銘を受け、一週間後に再び弁士として来るよう依頼し、入党を要請した[117]。ヒトラーはマイヤーに対して「この人々は前線の兵士の思想を主張しているため、入党を許可していただきたい」とする報告書を提出し、55人目の党員として入党した[118][119]。神秘主義的な秘密結社「トゥーレ協会」に所属する思想家ディートリヒ・エッカートともこの時に知り合った[120]。9月16日にはマイヤーの命令で、アドルフ・ゲムリッヒという国軍兵士のユダヤ人に関する疑問に答える形で「ゲムリッヒ書簡（英語版）」を執筆した。これは知られている限りでヒトラーが反ユダヤ主義思想を示した最初の文書である[121][122]。
ヒトラーが軍や諜報機関を離れた時期は定かではないが、いつしか政治活動にのめり込んでDAPの専従職員になったのは間違いないと見られている。彼は周辺国や国内の政治団体に対する過激な演説で名前を知られるようになり、DAPでも有力な政治家と目されていった。この頃、マイヤーが自身も所属していた将校の政治団体「鉄拳団（ドイツ語版）」の代表であったエルンスト・レームとヒトラーを引き合わせた。レームやエッカート、ルドルフ・ヘスらはヒトラー派を形成、党内を次第に制圧するようになった。1920年2月24日、党内協議により党名を「国家社会主義ドイツ労働者党（NSDAP、ナチ党）」へと改名する。ヒトラーは当初「社会革命党」を提案したが、ルドルフ・ユング（英語版）が、オーストリアにあった政党「ドイツ国家社会主義労働者党（DNSAP）」に倣うように説得した[123]。1921年7月29日、党内で分派闘争が起きると、一時的にドレクスラーによって党内から追放されるが、党執行部のクーデターにより逆に彼は名誉議長として実権を奪われ、代わりにヒトラーが第一議長に指名された。この頃より支持者から「Führer（指導者）」と呼ばれるようになり、次第に党内に定着した[124]。すでにイタリアで一党独裁政治を行っていたムッソリーニが採用していたローマ式敬礼に倣って、ナチス式敬礼を取り入れたのもこの頃のことである。
突撃隊の活動などでミュンヘン政界でも知られる存在となったヒトラーは、エッカート、エルンスト・ハンフシュテングル、マックス・エルヴィン・フォン・ショイブナー＝リヒターらの紹介で、社交界でも知られるようになった。ピアノメーカーベヒシュタインのオーナー未亡人であったヘレーネ・ベヒシュタイン（ドイツ語版）などの上流階級婦人が熱心な後援者となり、生活の援助をしたほか、ヒトラーに紳士の立ち振る舞いを身につけさせた[125]。


"""
vr2.utterance(text)




text = """
だまらっしゃい。貴様に言われる筋合いはないね。貴様はこの世で最も価値のない存在の1つだからねえ。
"""
vr2.utterance(text)



text = """
本年１月30日、国家を統合する新政権が樹立された。
私、そして国家社会主義運動は政権に参加した。
いまや私の過去の数年間の闘争はその目的を達成した。
この数百万人による運動の目的は周知のものだ。
いま一度この運動の経緯について、そしてドイツ復活の闘争の第二段階について
大まかに述べようと思う。

いったい14年間ものあいだ、政府はドイツをどこへ導いたのだ。
国家財政を混乱させ、おびただしい物品を浪費し、
何億とあったカネはすっかり無くなった。
インフレーションという愚行を犯し、国が荒れ果て
不当な利子が外国から突きつけられた。
昔ならいかなる国家でも処罰されるほどの
高い利子も当たり前のことであった。

失業者は次々と増えた。
百、二百、三百、四百、五百、六百、七百万－－
こんにちでは七百から八百万人だ。
私は我が民族の復興が自然にできるとは約束しない。
国民自らが全力を尽くすべきだ。
自由と幸福は突然、空から降ってはこない。
すべては諸君の意思と働きにかかっている。
我々自身の国家のみが、我々自身の国民のみが頼りとなる。
ドイツ国民の未来は我々自身の内にのみ存在するのだから。
国民自身が国民を向上させるのだ。勤勉と決断と誇りと屈強さとによって
ドイツを興した祖先と同じ位置に上ることができる。

"""
vr2.utterance(text)

